app/controllers/hash_tags_controller.rb

SELECT "hash_tags".* FROM "hash_tags" ORDER BY updated_at DESC LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM "hash_tags"
---
  def index
    expose HashTag.page(params[:page])

SELECT "hash_tags".* FROM "hash_tags" WHERE "hash_tags"."name" = 'great' ORDER BY updated_at DESC LIMIT 1
SELECT "texes".* FROM "texes" INNER JOIN "hash_tags_texes" ON "texes"."id" = "hash_tags_texes"."tex_id" WHERE "hash_tags_texes"."hash_tag_id" = 9 ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "texes" INNER JOIN "hash_tags_texes" ON "texes"."id" = "hash_tags_texes"."tex_id" WHERE "hash_tags_texes"."hash_tag_id" = 9
---
  def show
    if params[:id].to_i > 0
      @ht = HashTag.find(params[:id])
    else
      @ht = HashTag.where(name: params[:id]).first
    end
    expose @ht.texes.page(params[:page])