api/app/controllers/tex_controller.rb

  def index
    expose Tex.page(params[:page])
---
SELECT "texes".* FROM "texes" ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "texes"